# St7SetFreedomCaseRigidMotion

Sets the remove rigid body motion option for freedom cases of type inertia relief.

long St7SetFreedomCaseRigidMotion(long uID, long CaseNum, bool Remove)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Freedom case number.
Remove
True to remove rigid body motion.